 # DATA CLEANING WITH PANDAS


 Data source - https://data.cityofnewyork.us/Environment/2015-Street-Tree-Census-Tree-Data/uvpi-gqnh/about_data

Handling pandas dataframe - https://sparkbyexamples.com/pandas/how-to-count-duplicates-in-pandas-dataframe/

In [1]:
# Install required modules
%pip install pandas
%pip install matplotlib
%pip install seaborn

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (2.2.1)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: matplotlib in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (3.8.3)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (4.49.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.4.5)
Requirement already satisfied: numpy<2,>=1.21 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.26.4)
Requirement already satisfied: packaging>=20.0 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib) (24.0)
Requirement already satisfied: pillow>=8 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (10.2.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (1.26.4)
Requirement already satisfied: pandas>=1.2 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (2.2.1)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (3.8.3)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.49.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.5)
Requirement already satisfied: packaging>=20.0 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.0)
Requirement already satisfied: pillow>=8 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (10.2.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [2]:
# Import data abd show one 
df = pd.read_csv('../Data Cleaning Pandas/Data/NewYorkTreesHealthCensus.csv')
df.sample()

,created_at,tree_id,block_id,the_geom,tree_dbh,stump_diam,curb_loc,status,health,spc_latin,...,st_assem,st_senate,nta,nta_name,boro_ct,state,Latitude,longitude,x_sp,y_sp
26253,09/03/2015,691505.0,341757.0,POINT (-73.87849602910924 40.75912069688515),21.0,0,OnCurb,Alive,Good,Ulmus americana,...,34.0,13.0,QN28,Jackson Heights,4033900.0,New York,40.759121,-73.878496,1017910.834,215868.1976

## Explore the dataframe

In [3]:
# View structure of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 42 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   created_at  50000 non-null  object
 1   tree_id     49873 non-null  float64
 2   block_id    49967 non-null  float64
 3   the_geom    50000 non-null  object
 4   tree_dbh    49895 non-null  float64
 5   stump_diam  50000 non-null  int64
 6   curb_loc    50000 non-null  object
 7   status      49674 non-null  object
 8   health      47732 non-null  object
 9   spc_latin   47732 non-null  object
 10  spc_common  47732 non-null  object
 11  steward     10715 non-null  object
 12  guards      4953 non-null   object
 13  sidewalk    47732 non-null  object
 14  user_type   50000 non-null  object
 15  problems    15603 non-null  object
 16  root_stone  50000 non-null  object
 17  root_grate  50000 non-null  object
 18  root_other  50000 non-null  object
 19  trnk_wire   50000 non-null  object
 20  trnk_light  50000 non-null  object
 21  trnk_other  50000 non-null  object
 22  brnch_ligh  50000 non-null  object
 23  brnch_shoe  50000 non-null  object
 24  brnch_othe  50000 non-null  object
 25  address     50000 non-null  object
 26  zipcode     50000 non-null  int64
 27  zip_city    50000 non-null  object
 28  cb_num      50000 non-null  float64
 29  borocode    50000 non-null  float64
 30  boroname    49976 non-null  object
 31  cncldist    50000 non-null  float64
 32  st_assem    50000 non-null  float64
 33  st_senate   50000 non-null  float64
 34  nta         50000 non-null  object
 35  nta_name    50000 non-null  object
 36  boro_ct     50000 non-null  float64
 37  state       50000 non-null  object
 38  Latitude    50000 non-null  float64
 39  longitude   50000 non-null  float64
 40  x_sp        50000 non-null  float64
 41  y_sp        50000 non-null  float64
dtypes: float64(13), int64(2), object(27)
memory usage: 16.0+ MB

In [4]:
# Structure 
print('Dimension of data : ', df.shape)
print('Dataframe type : ', type(df))

Dimension of data :  (50000, 42)
Dataframe type :  <class 'pandas.core.frame.DataFrame'>

### Subset Data
This is a large dataset, lets subset the data by randomly selecting 5000 observations.

In [5]:
# Select 2000 random rows

subset = df.sample(n=2000)
subset.shape

(2000, 42)

In [6]:
# display all the rows
pd.set_option("display.max_rows", None)

### Drop Columns.

In [7]:
# Column data types
subset.dtypes

created_at     object
tree_id       float64
block_id      float64
the_geom       object
tree_dbh      float64
stump_diam      int64
curb_loc       object
status         object
health         object
spc_latin      object
spc_common     object
steward        object
guards         object
sidewalk       object
user_type      object
problems       object
root_stone     object
root_grate     object
root_other     object
trnk_wire      object
trnk_light     object
trnk_other     object
brnch_ligh     object
brnch_shoe     object
brnch_othe     object
address        object
zipcode         int64
zip_city       object
cb_num        float64
borocode      float64
boroname       object
cncldist      float64
st_assem      float64
st_senate     float64
nta            object
nta_name       object
boro_ct       float64
state          object
Latitude      float64
longitude     float64
x_sp          float64
y_sp          float64
dtype: object

In [8]:
# Print column names
subset.columns.values

array(['created_at', 'tree_id', 'block_id', 'the_geom', 'tree_dbh',
       'stump_diam', 'curb_loc', 'status', 'health', 'spc_latin',
       'spc_common', 'steward', 'guards', 'sidewalk', 'user_type',
       'problems', 'root_stone', 'root_grate', 'root_other', 'trnk_wire',
       'trnk_light', 'trnk_other', 'brnch_ligh', 'brnch_shoe',
       'brnch_othe', 'address', 'zipcode', 'zip_city', 'cb_num',
       'borocode', 'boroname', 'cncldist', 'st_assem', 'st_senate', 'nta',
       'nta_name', 'boro_ct', 'state', 'Latitude', 'longitude', 'x_sp',
       'y_sp'], dtype=object)

In [9]:
# Check columns of integer values
subset.describe()

,tree_id,block_id,tree_dbh,stump_diam,zipcode,cb_num,borocode,cncldist,st_assem,st_senate,boro_ct,Latitude,longitude,x_sp,y_sp
count,1997.000000,1998.000000,1999.000000,2000.000000,2000.00000,2000.000000,2000.000000,2000.000000,2000.000000,2000.0000,2.000000e+03,2000.000000,2000.000000,2.000000e+03,2000.000000
mean,439311.466700,328616.916917,11.421211,0.569500,10917.79300,352.869000,3.450500,30.603500,51.006500,20.5320,3.499066e+06,40.699844,-73.919962,1.006412e+06,194285.796974
std,154491.438168,112695.635602,8.915052,3.678714,696.28834,111.077103,1.122577,14.117682,19.378473,7.6092,1.128863e+06,0.093984,0.130491,3.620176e+04,34241.030221
min,10924.000000,100352.000000,0.000000,0.000000,83.00000,101.000000,1.000000,1.000000,23.000000,10.0000,1.000600e+06,40.499227,-74.251952,9.141888e+05,121249.798900
25%,308582.000000,225728.250000,4.000000,0.000000,10454.00000,304.000000,3.000000,19.000000,33.000000,14.0000,3.017900e+06,40.625678,-73.979856,9.898396e+05,167236.933375
50%,437987.000000,325980.000000,9.000000,0.000000,11212.50000,404.000000,4.000000,30.000000,52.000000,20.0000,4.018550e+06,40.697203,-73.903533,1.010984e+06,193306.869000
75%,567286.000000,408604.250000,16.000000,0.000000,11365.00000,413.000000,4.000000,44.000000,64.000000,24.0000,4.119000e+06,40.762393,-73.822941,1.033293e+06,217154.773200
max,722455.000000,602903.000000,89.000000,51.000000,11694.00000,503.000000,5.000000,51.000000,87.000000,36.0000,5.031902e+06,40.908513,-73.700980,1.067109e+06,270288.524100

In [10]:
# Select few columns 
df2 = subset[['created_at','tree_id','tree_dbh','status','address','boroname','Latitude', 'longitude']]
df2.columns.values

array(['created_at', 'tree_id', 'tree_dbh', 'status', 'address',
       'boroname', 'Latitude', 'longitude'], dtype=object)

In [11]:
# Check the first 5 observations
df2.head()

,created_at,tree_id,tree_dbh,status,address,boroname,Latitude,longitude
27879,12/22/2015,378158.0,10.0,Alive,176 KENILWORTH AVENUE,Staten Island,40.561722,-74.182680
31877,09/21/2015,606055.0,3.0,NaN,2 WEST 102 STREET,Manhattan,40.795328,-73.961862
12707,10/20/2015,560620.0,8.0,Alive,811 RATHBUN AVENUE,Staten Island,40.537984,-74.202622
30541,05/22/2016,319737.0,8.0,Alive,84-025 109 STREET,Queens,40.700351,-73.840811
13729,11/16/2015,431149.0,16.0,Alive,60 NEW DORP LANE,Staten Island,40.574816,-74.118055

In [12]:
# Check the first 5 observations
df2.tail()

,created_at,tree_id,tree_dbh,status,address,boroname,Latitude,longitude
39795,06/02/2016,302519.0,10.0,Alive,232-014 MENTONE AVENUE,Queens,40.666478,-73.742346
1241,08/17/2016,249504.0,6.0,Alive,146-022 183 STREET,Queens,40.661836,-73.763682
160,11/17/2015,392312.0,4.0,Alive,2828 VALENTINE AVENUE,Bronx,40.868849,-73.890413
4434,07/08/2016,288646.0,9.0,Alive,571 50 STREET,Brooklyn,40.643949,-74.008519
887,06/23/2016,278923.0,24.0,Alive,148-009 9 AVENUE,Queens,40.792452,-73.818616

### Rename Columns

## Duplicate Values.

These are rows that have exactly the same values across all columns. Since the tree_id uniqely identifies each tree, we will count values in this column.

In [13]:
duplicates = len(df2['tree_id'])-len(df2['tree_id'].drop_duplicates())
duplicates

2

### Remove duplicates

In [14]:
df2.drop_duplicates(subset="tree_id", keep=False, inplace=True)

# Check if duplicate values have been removed 
len(f'New dataframe has {df2} observations.')

/tmp/ipykernel_7079/2602595890.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop_duplicates(subset="tree_id", keep=False, inplace=True)

283749

### Split Columns.

The address, 23-091 29 STREET, column consists of house number as 23-091 and street name as 29 STREET. Lets split these and place each in its own column.

In [61]:
# Check if any column contains a muissing value
print(df2.isnull().any())

created_at    False
tree_id       False
tree_dbh       True
status         True
address       False
boroname      False
Latitude      False
longitude     False
dtype: bool

In [75]:
# Sort by tree_id

# Sorting by column 'Country'
df2 = df2.sort_values(by=['tree_id'])
df2


# df2

,created_at,tree_id,tree_dbh,status,address,boroname,Latitude,longitude
434,12/09/2015,2188.0,7.0,Alive,148 PETRUS AVENUE,Staten Island,40.546359,-74.171486
37004,09/13/2016,18096.0,31.0,Alive,2355 EAST 18 STREET,Brooklyn,40.593280,-73.952370
12956,09/05/2016,23840.0,13.0,Alive,172-011 67 AVENUE,Queens,40.734688,-73.796834
5274,06/16/2016,30087.0,12.0,Alive,78-057 268 STREET,Queens,40.748385,-73.704446
27837,09/13/2016,47722.0,5.0,Alive,772 MAC DONOUGH STREET,Brooklyn,40.684187,-73.915534
...,...,...,...,...,...,...,...,...
28663,08/17/2015,720179.0,12.0,Alive,2164 78 STREET,Brooklyn,40.606851,-73.989909
30374,08/28/2015,720344.0,11.0,Alive,33-040 74 STREET,Queens,40.753596,-73.892652
22917,08/30/2015,720487.0,2.0,Alive,65-036 99 STREET,Queens,40.728928,-73.855504
10254,08/26/2015,720526.0,6.0,Alive,66 BARBEY STREET,Brooklyn,40.681592,-73.889845
3965,09/07/2015,721015.0,21.0,Alive,100 WEST 79 STREET,Manhattan,40.781923,-73.975323

In [76]:
# changing the max_rows value to display all the rows
pd.set_option('display.max_rows', 100)

# Split the address column, by default uses space
df2["address"].str.split()

434            [148, PETRUS, AVENUE]
37004       [2355, EAST, 18, STREET]
12956          [172-011, 67, AVENUE]
5274           [78-057, 268, STREET]
27837    [772, MAC, DONOUGH, STREET]
                    ...
28663             [2164, 78, STREET]
30374           [33-040, 74, STREET]
22917           [65-036, 99, STREET]
10254           [66, BARBEY, STREET]
3965         [100, WEST, 79, STREET]
Name: address, Length: 1997, dtype: object

In [84]:
# Split on the first space delimiter 
df2["address"].str.split(" ", n=1)

434           [148, PETRUS AVENUE]
37004       [2355, EAST 18 STREET]
12956         [172-011, 67 AVENUE]
5274          [78-057, 268 STREET]
27837    [772, MAC DONOUGH STREET]
                   ...
28663            [2164, 78 STREET]
30374          [33-040, 74 STREET]
22917          [65-036, 99 STREET]
10254          [66, BARBEY STREET]
3965         [100, WEST 79 STREET]
Name: address, Length: 1997, dtype: object

In [79]:
# Split and place each on its column 
df2["address"].str.split("-", n=1, expand=True)

                            0               1
434         148 PETRUS AVENUE            None
37004     2355 EAST 18 STREET            None
12956                     172   011 67 AVENUE
5274                       78  057 268 STREET
27837  772 MAC DONOUGH STREET            None
...                       ...             ...
28663          2164 78 STREET            None
30374                      33   040 74 STREET
22917                      65   036 99 STREET
10254        66 BARBEY STREET            None
3965       100 WEST 79 STREET            None

[1997 rows x 2 columns]

In [23]:
# Create a new dataframe with additional columns 
df3 = df2["address"].str.split(" ", n=1, expand=True)

# Rename new columns 
df3

            0                 1
4620     1023     REVERE AVENUE
1673   43-002        250 STREET
24650     384     FULTON STREET
41203       2  KINGSLAND AVENUE
48989     900   GRAND CONCOURSE
...       ...               ...
43538     429         81 STREET
36413    1299  INTERVALE AVENUE
39248  78-060         82 STREET
26693  34-016         43 STREET
25788   3-009         147 PLACE

[1998 rows x 2 columns]

In [89]:
# Extract any digits between hyphen and place in  new column 
df2['house number'] = df2["address"].str.extract(r'(\d+\-\d+)')
df2

,created_at,tree_id,tree_dbh,status,address,boroname,Latitude,longitude,house number
434,12/09/2015,2188.0,7.0,Alive,148 PETRUS AVENUE,Staten Island,40.546359,-74.171486,NaN
37004,09/13/2016,18096.0,31.0,Alive,2355 EAST 18 STREET,Brooklyn,40.593280,-73.952370,NaN
12956,09/05/2016,23840.0,13.0,Alive,172-011 67 AVENUE,Queens,40.734688,-73.796834,172-011
5274,06/16/2016,30087.0,12.0,Alive,78-057 268 STREET,Queens,40.748385,-73.704446,78-057
27837,09/13/2016,47722.0,5.0,Alive,772 MAC DONOUGH STREET,Brooklyn,40.684187,-73.915534,NaN
...,...,...,...,...,...,...,...,...,...
28663,08/17/2015,720179.0,12.0,Alive,2164 78 STREET,Brooklyn,40.606851,-73.989909,NaN
30374,08/28/2015,720344.0,11.0,Alive,33-040 74 STREET,Queens,40.753596,-73.892652,33-040
22917,08/30/2015,720487.0,2.0,Alive,65-036 99 STREET,Queens,40.728928,-73.855504,65-036
10254,08/26/2015,720526.0,6.0,Alive,66 BARBEY STREET,Brooklyn,40.681592,-73.889845,NaN
3965,09/07/2015,721015.0,21.0,Alive,100 WEST 79 STREET,Manhattan,40.781923,-73.975323,NaN

In [93]:
df2["address"].str.extract(r'(\d+\s\[A-Z])')

         0
434    NaN
37004  NaN
12956  NaN
5274   NaN
27837  NaN
...    ...
28663  NaN
30374  NaN
22917  NaN
10254  NaN
3965   NaN

[1997 rows x 1 columns]

In [101]:
# One or more upper case
df2["address"].str.extract(r'([A-Z]+)')

                0
434    148 PETRUS
37004   2355 EAST
12956   67 AVENUE
5274   268 STREET
27837     772 MAC
...           ...
28663   78 STREET
30374   74 STREET
22917   99 STREET
10254   66 BARBEY
3965     100 WEST

[1997 rows x 1 columns]

In [99]:
# 6 consecetive upper case
df2["address"].str.extract(r'([A-Z]{6})')

            0
434    PETRUS
37004  STREET
12956  AVENUE
5274   STREET
27837  DONOUG
...       ...
28663  STREET
30374  STREET
22917  STREET
10254  BARBEY
3965   STREET

[1997 rows x 1 columns]

In [102]:
# one or more digits , followed by space, followed by one or more upper case letters
df2["address"].str.extract(r'(\d+\s[A-Z]+)')

                0
434    148 PETRUS
37004   2355 EAST
12956   67 AVENUE
5274   268 STREET
27837     772 MAC
...           ...
28663   78 STREET
30374   74 STREET
22917   99 STREET
10254   66 BARBEY
3965     100 WEST

[1997 rows x 1 columns]